# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
terraform_data.created_at: Refreshing state... [id=215f1827-bb65-28e2-a591-aa1042941599]
azuread_group.readers["pap-prod"]: Refreshing state... [id=d5e910d1-440f-4689-9932-75095784ede3]
azuread_group.product_admins: Refreshing state... [id=185ee3a4-7906-4c2d-9582-80526f094039]
data.azuread_client_config.current: Reading...
data.azuread_application_published_app_ids.well_known: Reading...
azuread_application.administrator: Refreshing state... [id=/applications/005b1c70-6fa7-4205-9fa1-8b7a53713238]
data.azuread_client_config.current: Read complete after 0s [id=cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c-c217a3ea-402f-4886-ace5-478db72ab4c9-cc75a1cc-d6a1-4530-828f-86832ce91b9b]
azuread_group.readers["pap-dev"]: Refreshing state... [id=2af7e5da-a5d6-4959-9fd3-4881f8486b48]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
azuread_group.readers["paa-prod"]: Refreshing state... [id=bf675438-09b8-43f9-a937-2234e911664d]
azuread_group.readers["pas-dev"]: Refreshing state... [id=c6a58841-32b9-4d00-986a-1d86af5ab745]
azuread_group.readers["paa-dev"]: Refreshing state... [id=0c61cc27-4737-4667-8a54-3b9a3ee33729]
azuread_group.readers["pas-prod"]: Refreshing state... [id=a267602b-75ec-42cf-a8d8-eb9ccd4bf68c]
azuread_group.readers["ddp-prod"]: Refreshing state... [id=2beeb094-0970-42bb-9ba4-7e1ba5ed9904]
azuread_group.readers["ddp-dev"]: Refreshing state... [id=4820e9b1-488c-4bf2-b9b0-19dd5131d056]
azuread_application.product["ddp-digdir-dialogporten-prod"]: Refreshing state... [id=/applications/7b6bf5c2-0aba-4a1e-a905-4eb9224a1762]
azuread_application.product["ddp-digdir-dialogporten-frontend-prod"]: Refreshing state... [id=/applications/37961029-aa8f-4fca-a716-fd4e41fa8a4c]
azuread_application.product["paa-altinn-altinn-access-management-dev"]: Refreshing state... [id=/applications/ffc7d734-7f12-4e59-b557-3e328fba3726]
azuread_application.product["pap-altinn-altinn-platform-prod"]: Refreshing state... [id=/applications/624d155b-6f97-407a-962e-c016af83390d]
azuread_application.product["pap-altinn-altinn-platform-dev"]: Refreshing state... [id=/applications/22c0f296-2d81-4226-8ad9-751e73d5ec38]
azuread_application.product["pas-altinn-altinn-studio-prod"]: Refreshing state... [id=/applications/129ddd31-cb8c-44e8-a184-e22262127add]
azuread_application.product["paa-altinn-altinn-access-management-prod"]: Refreshing state... [id=/applications/4723b56d-ccf2-47a9-88c1-dfacde1b8d91]
azuread_application.product["ddp-digdir-dialogporten-dev"]: Refreshing state... [id=/applications/cfcbc98d-2e76-49af-8ebb-29f286740084]
azuread_application.product["paa-altinn-altinn-authorization-dev"]: Refreshing state... [id=/applications/b177be4c-4798-4ba7-9b42-bf1ff9cfb160]
azuread_application.product["ddp-digdir-dialogporten-frontend-dev"]: Refreshing state... [id=/applications/82556fa2-e45f-4574-b560-f82171ed3272]
azuread_application.product["paa-altinn-altinn-authorization-prod"]: Refreshing state... [id=/applications/47569b89-a6f4-48f7-a47a-a236cdbf5319]
azuread_application.product["pas-altinn-altinn-studio-dev"]: Refreshing state... [id=/applications/637a66e7-6cb2-43f1-bf43-1dc02efd5a0f]
azuread_group.admins["paa-dev"]: Refreshing state... [id=93bed750-6ca4-47ae-ac43-b45fff4930f6]
azuread_group.admins["paa-prod"]: Refreshing state... [id=3863fbc0-a24b-42bf-af3d-f45111814457]
azuread_group.admins["pap-prod"]: Refreshing state... [id=e64c1a5a-8050-4e1a-aaa4-f33456d10a4c]
azuread_group.admins["ddp-dev"]: Refreshing state... [id=97e9f819-24e9-4b19-8f88-f3963bb7172a]
azuread_group.admins["pap-dev"]: Refreshing state... [id=58b06c12-1d0c-4e9d-a8d2-aae87ef6de69]
azuread_group.admins["pas-prod"]: Refreshing state... [id=a9b56ec3-a1d2-4f3d-be91-997daa086f07]
azuread_group.admins["pas-dev"]: Refreshing state... [id=a71dd8f7-7a59-400f-8fc4-10f99d073aff]
azuread_group.admins["ddp-prod"]: Refreshing state... [id=f1ee6dea-9016-46c3-9d6b-cc2930f5d2fa]
azuread_group.developers["pas-prod"]: Refreshing state... [id=750bb70f-ccc8-440a-949a-2de1c352d9e4]
azuread_group.developers["pap-dev"]: Refreshing state... [id=a8e8bad1-021e-4c4a-9d91-c50ef683fd48]
azuread_group.developers["paa-prod"]: Refreshing state... [id=c410f062-def4-44f5-9a45-b23ddcdd57c3]
azuread_group.developers["ddp-dev"]: Refreshing state... [id=c12e51e3-5cbd-4229-8a31-5394c423fb5f]
azuread_group.developers["paa-dev"]: Refreshing state... [id=6d54df21-3547-41a2-8d0d-529fad054807]
azuread_group.developers["pap-prod"]: Refreshing state... [id=1ae55f0f-b196-4c0b-9f5a-d57d0d738582]
azuread_group.developers["ddp-prod"]: Refreshing state... [id=a94de4bf-0a83-4d30-baba-0c6a7365571c]
azuread_group.developers["pas-dev"]: Refreshing state... [id=81fa29d0-1ade-4c00-a83f-97a7cdc4eb15]
data.azuread_directory_object.current: Reading...
data.azuread_service_principal.msgraph: Reading...
azuread_service_principal.administrator: Refreshing state... [id=cc75a1cc-d6a1-4530-828f-86832ce91b9b]
azuread_application_federated_identity_credential.oidc_environments_admin["yt01"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/0622fe18-e790-447c-a293-abffa48c97a8]
azuread_application_federated_identity_credential.oidc_environments_admin["at21"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/f6be0dc6-d3e7-410c-b97d-34effbad46f2]
data.azuread_directory_object.current: Read complete after 0s [id=cc75a1cc-d6a1-4530-828f-86832ce91b9b]
azuread_application_federated_identity_credential.oidc_environments_admin["staging"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/5c870907-bcc2-4142-be68-88fb99eb2caf]
azuread_application_federated_identity_credential.oidc_environments_admin["at22"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/a7efa549-82be-4b7b-bc2d-39336f984103]
azuread_application_federated_identity_credential.oidc_environments_admin["test"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/22218dde-c959-4878-824d-f16af0245431]
azuread_application_federated_identity_credential.oidc_environments_admin["tt02"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/f65f0a1e-1997-4b7d-a9ae-2c83508ab58f]
azuread_application_federated_identity_credential.oidc_environments_admin["at25"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/48074d9e-3975-440a-ad6f-00714751ac8f]
azuread_application_federated_identity_credential.oidc_environments_admin["at23"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/2ece2fec-a222-4a38-8a0f-27bdfb160338]
azuread_application_federated_identity_credential.oidc_environments_admin["prod"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/7d788d72-d8fb-4517-9709-23fe17935655]
azuread_application_federated_identity_credential.oidc_environments_admin["at24"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/20394998-885a-460d-9794-136409e3a014]
azuread_application_federated_identity_credential.oidc_environments_admin["dev"]: Refreshing state... [id=005b1c70-6fa7-4205-9fa1-8b7a53713238/federatedIdentityCredential/56691ab1-080e-4a12-95a5-e578a8d1cc4b]
azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-access-management-prod"]: Refreshing state... [id=4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/374c5239-183b-44ad-8313-981cb8e5a990]
azuread_application_federated_identity_credential.oidc_branch["pas-altinn-altinn-studio-prod"]: Refreshing state... [id=129ddd31-cb8c-44e8-a184-e22262127add/federatedIdentityCredential/17c7c5bf-e499-4e3f-a5c0-6671c01a97ca]
azuread_application_federated_identity_credential.oidc_branch["ddp-digdir-dialogporten-dev"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/b2ec68c7-e5c7-4346-9376-0aecfdd86298]
azuread_application_federated_identity_credential.oidc_branch["ddp-digdir-dialogporten-prod"]: Refreshing state... [id=7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/fd971696-9e65-4dc5-9510-40fb32e6157d]
azuread_application_federated_identity_credential.oidc_branch["pap-altinn-altinn-platform-prod"]: Refreshing state... [id=624d155b-6f97-407a-962e-c016af83390d/federatedIdentityCredential/7c692bf6-2b07-412b-ac00-562aa645e123]
azuread_application_federated_identity_credential.oidc_branch["pas-altinn-altinn-studio-dev"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/fb2d44db-8d8b-4730-9094-0316cb213164]
azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-access-management-dev"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/cea3fcdf-6a4a-49aa-9898-052c74cc65dd]
azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-authorization-prod"]: Refreshing state... [id=47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/563af092-44da-4c6a-bb1c-f3c8093e1767]
azuread_application_federated_identity_credential.oidc_branch["ddp-digdir-dialogporten-frontend-dev"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/1e0a30cc-4cd7-440d-9cdb-d623e53ae378]
azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-authorization-dev"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/4a1ef995-8829-4ef0-8462-813e9b73b3a8]
azuread_application_federated_identity_credential.oidc_branch["ddp-digdir-dialogporten-frontend-prod"]: Refreshing state... [id=37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/6acd314e-b8a3-47f5-9689-c544959c028b]
azuread_application_federated_identity_credential.oidc_branch["pap-altinn-altinn-platform-dev"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/f429e76b-8d91-402b-8af6-e128f50d4202]
azuread_service_principal.product["paa-altinn-altinn-access-management-prod"]: Refreshing state... [id=0e4c6f75-d2d3-497d-9cad-53f29dae3519]
azuread_service_principal.product["paa-altinn-altinn-access-management-dev"]: Refreshing state... [id=4f0c01c2-6926-4876-bb46-7b5767fa88d8]
azuread_service_principal.product["pas-altinn-altinn-studio-dev"]: Refreshing state... [id=512341b6-a349-4d08-8301-154a48a43b13]
data.azuread_service_principal.msgraph: Read complete after 1s [id=b9d7b3d8-a063-4e34-89d9-15db56e22d42]
azuread_service_principal.product["paa-altinn-altinn-authorization-dev"]: Refreshing state... [id=397ab30e-26b2-452c-81d8-ae5cc9bb34ad]
azuread_service_principal.product["ddp-digdir-dialogporten-frontend-prod"]: Refreshing state... [id=d1a822c0-d5e4-4f7e-9793-b296efcf1dee]
azuread_service_principal.product["paa-altinn-altinn-authorization-prod"]: Refreshing state... [id=e78af13a-c354-4674-8d49-07cf17eb2e8f]
azuread_service_principal.product["ddp-digdir-dialogporten-frontend-dev"]: Refreshing state... [id=04218107-d720-4b10-8b45-6f4404170511]
azuread_service_principal.product["pap-altinn-altinn-platform-dev"]: Refreshing state... [id=854b1c97-b5e2-4e17-8e3e-b9813fc21168]
azuread_service_principal.product["pas-altinn-altinn-studio-prod"]: Refreshing state... [id=99357379-c461-45bc-b9e7-6a2a51ccdac0]
azuread_service_principal.product["ddp-digdir-dialogporten-prod"]: Refreshing state... [id=1ab67334-88c1-4c95-8849-96b64f2035fa]
azuread_service_principal.product["ddp-digdir-dialogporten-dev"]: Refreshing state... [id=871fb027-f695-4936-b80a-c035462305d8]
azuread_service_principal.product["pap-altinn-altinn-platform-prod"]: Refreshing state... [id=c5a4a3da-2990-4734-9281-c40368ac0861]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at21"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/62b6276a-3989-4e57-a64e-2106c1435961]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at24"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/7218f6e3-eec9-45c5-a2c7-34de52eb2443]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at24"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/1e25bc03-d23c-4415-a17e-f5d351a9a45f]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at22"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/bbe50ae1-7456-4ffc-9e02-e95aa8e9d228]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at23"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/e6d65feb-e336-4023-95fe-92cdb463e1df]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-prod-staging"]: Refreshing state... [id=129ddd31-cb8c-44e8-a184-e22262127add/federatedIdentityCredential/5f39c150-6f5b-45e4-9a16-ae1169b4d50d]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at24"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/d39800eb-1b77-460b-a3e0-ae09a1ae6cb3]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-at25"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/f6eafa40-508e-495b-a9e3-b435560bfbf0]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-prod-staging"]: Refreshing state... [id=47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/65d79a35-f3ef-45e4-9212-f85867645323]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-prod-tt02"]: Refreshing state... [id=7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/887136a2-3c48-4c27-88e8-014012792036]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at24"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/e74301c9-5c8f-48ad-86d8-9050073e2938]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-at24"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/53c782ca-e326-40f8-8ecf-9ea9c072b1a7]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at21"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/18b59993-0ba9-47fa-be9a-5912cb40628a]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-test"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/bcfe7c63-36b3-4e51-b99c-447191477472]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-dev"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/93200667-0bf8-4b9c-9c93-cdd89391a54c]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-prod-prod"]: Refreshing state... [id=47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/102547a4-741e-4404-8d2c-aed50476d441]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-prod-tt02"]: Refreshing state... [id=47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/7730379c-513c-4b26-b6e1-b93c9a09b178]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-dev"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/18e08433-1c50-49f9-8531-618c0437f277]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at25"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/6539a5d0-42fe-4b59-baf8-2bf92d33ce1e]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-at21"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/d451342e-baa0-4127-8026-ffdcda4097c1]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at23"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/17be0834-cdbc-4554-baa9-e332aa7f86ef]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at25"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/f42e72f1-8742-462c-a4e0-361420e9dbf2]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-dev"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/e254258e-7daf-4069-b047-2d163ac295a2]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-at23"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/e9bb72a9-1771-491d-ae2d-62b74e68aa3f]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-test"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/3199b003-3602-4ebe-bca0-7dc4eaf4d3dc]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-prod-staging"]: Refreshing state... [id=4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/087a42d2-c2a1-4797-bf14-4a7f7b428c74]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-prod-staging"]: Refreshing state... [id=624d155b-6f97-407a-962e-c016af83390d/federatedIdentityCredential/f9850d8e-1ff4-40ff-8a9a-22a14b0eae0c]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-prod-prod"]: Refreshing state... [id=7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/c0b09f9c-446b-42fc-a5e1-145dc216d525]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-prod-tt02"]: Refreshing state... [id=4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/e21c2a97-8c6d-4230-8376-4dec5cfb04ab]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at25"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/7c929e63-5460-46cf-adb9-7cecbb3b6e87]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-dev"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/c925c5c7-e1de-449b-b973-21d6ac21d9f9]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-dev"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/fde20bfe-2d2f-4284-b84e-a40717ad976d]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-test"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/0140fdea-948b-4f09-874e-a80a04f53be2]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-at24"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/41f20051-aa54-460e-a545-9e8f0fbef671]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at21"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/8885e560-6203-405f-9e16-649e04b8f671]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-yt01"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/fab4e22d-33df-4bc6-ae6a-138656183f4a]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-prod-prod"]: Refreshing state... [id=129ddd31-cb8c-44e8-a184-e22262127add/federatedIdentityCredential/e8da2e5e-e8a1-4ac1-9a85-f90a25999219]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at21"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/aac10cd9-4c24-4b26-8fca-73c39bb89eae]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-test"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/5723700e-a6e2-41a4-b0dd-eda4e7fb4761]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-yt01"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/087ba363-e9f5-40b2-832f-f788b3d2d53d]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-prod-staging"]: Refreshing state... [id=7b6bf5c2-0aba-4a1e-a905-4eb9224a1762/federatedIdentityCredential/0997bc15-4ea6-4b8e-8657-fa0362e045ea]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at23"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/b4a0c06a-5955-4ac8-bdf5-6ec43eca18b5]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-at22"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/73598536-2bde-4539-899a-4c181685a843]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-prod-prod"]: Refreshing state... [id=37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/88761082-0a48-4b72-b381-cfccd616002c]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-at23"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/3aca3d22-d89b-428d-810b-7e95a6434d82]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-prod-prod"]: Refreshing state... [id=4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/e71b5faf-8fb5-43a3-a3a1-593f1d726bc9]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at22"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/19427452-8180-455a-a136-839b3c71a904]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-dev-at25"]: Refreshing state... [id=82556fa2-e45f-4574-b560-f82171ed3272/federatedIdentityCredential/550adf3d-2c58-4513-9298-d11856d6aa1c]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-yt01"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/ffe73551-41b4-4964-a147-4e06d9bb7af2]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-yt01"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/6a0c8f14-f40e-4d75-b086-760bfe2b96b9]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-at21"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/5819e890-30f6-41d5-a5b1-9923d7266b5d]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-prod-staging"]: Refreshing state... [id=37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/4dd03aa0-dbac-480c-ae28-17b442d665a2]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-frontend-prod-tt02"]: Refreshing state... [id=37961029-aa8f-4fca-a716-fd4e41fa8a4c/federatedIdentityCredential/1d52c13e-8b62-4197-966c-df46b307e14a]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-prod-tt02"]: Refreshing state... [id=129ddd31-cb8c-44e8-a184-e22262127add/federatedIdentityCredential/a118ed7f-9d69-4a93-b39a-368c12859f27]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at22"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/8ed8bb87-983a-41e0-b9d2-346f963988f1]
azuread_application_federated_identity_credential.oidc_environments["pas-altinn-altinn-studio-dev-at25"]: Refreshing state... [id=637a66e7-6cb2-43f1-bf43-1dc02efd5a0f/federatedIdentityCredential/8b69b896-27ad-425a-9a2f-1ebab0f69584]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-yt01"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/91e64601-6beb-4c03-b402-bb635bec79f5]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-dev"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/68772c40-acfd-43d4-9ab8-9ebedcc8f76a]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-dev-at22"]: Refreshing state... [id=22c0f296-2d81-4226-8ad9-751e73d5ec38/federatedIdentityCredential/d65e7838-f7da-41de-bb37-327b3f2647ec]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-prod-tt02"]: Refreshing state... [id=624d155b-6f97-407a-962e-c016af83390d/federatedIdentityCredential/7b281697-d8a5-4460-83f2-690707b701b5]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-yt01"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/a34f832d-caaa-45f0-bff9-1f974aae3282]
azuread_application_federated_identity_credential.oidc_environments["pap-altinn-altinn-platform-prod-prod"]: Refreshing state... [id=624d155b-6f97-407a-962e-c016af83390d/federatedIdentityCredential/b6d72fd1-7710-477c-8719-aad07fbe5dd5]
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-test"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/44ed808e-149b-428d-9588-f68a67208b73]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at22"]: Refreshing state... [id=b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/eae19bf9-c102-415c-84a0-2e6c559e59be]
azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-test"]: Refreshing state... [id=ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/65a743fe-3c98-41d2-89a6-f13c29ed1aac]
data.azuread_service_principal.current[0]: Reading...
azuread_application_federated_identity_credential.oidc_environments["ddp-digdir-dialogporten-dev-at23"]: Refreshing state... [id=cfcbc98d-2e76-49af-8ebb-29f286740084/federatedIdentityCredential/79ec1dc5-2d72-444e-9137-fddf5d66694d]
azuread_group_member.product_admins: Refreshing state... [id=185ee3a4-7906-4c2d-9582-80526f094039/member/cc75a1cc-d6a1-4530-828f-86832ce91b9b]
azuread_group_member.admin_contributor["paa-dev"]: Refreshing state... [id=6d54df21-3547-41a2-8d0d-529fad054807/member/93bed750-6ca4-47ae-ac43-b45fff4930f6]
azuread_group_member.admin_contributor["ddp-prod"]: Refreshing state... [id=a94de4bf-0a83-4d30-baba-0c6a7365571c/member/f1ee6dea-9016-46c3-9d6b-cc2930f5d2fa]
azuread_group_member.admin_contributor["pap-dev"]: Refreshing state... [id=a8e8bad1-021e-4c4a-9d91-c50ef683fd48/member/58b06c12-1d0c-4e9d-a8d2-aae87ef6de69]
azuread_group_member.admin_contributor["ddp-dev"]: Refreshing state... [id=c12e51e3-5cbd-4229-8a31-5394c423fb5f/member/97e9f819-24e9-4b19-8f88-f3963bb7172a]
azuread_group_member.admin_contributor["pas-dev"]: Refreshing state... [id=81fa29d0-1ade-4c00-a83f-97a7cdc4eb15/member/a71dd8f7-7a59-400f-8fc4-10f99d073aff]
azuread_group_member.admin_contributor["pap-prod"]: Refreshing state... [id=1ae55f0f-b196-4c0b-9f5a-d57d0d738582/member/e64c1a5a-8050-4e1a-aaa4-f33456d10a4c]
azuread_group_member.admin_contributor["pas-prod"]: Refreshing state... [id=750bb70f-ccc8-440a-949a-2de1c352d9e4/member/a9b56ec3-a1d2-4f3d-be91-997daa086f07]
azuread_group_member.admin_contributor["paa-prod"]: Refreshing state... [id=c410f062-def4-44f5-9a45-b23ddcdd57c3/member/3863fbc0-a24b-42bf-af3d-f45111814457]
azuread_group_member.contributor_reader["pap-prod"]: Refreshing state... [id=d5e910d1-440f-4689-9932-75095784ede3/member/1ae55f0f-b196-4c0b-9f5a-d57d0d738582]
data.azuread_service_principal.current[0]: Read complete after 1s [id=cc75a1cc-d6a1-4530-828f-86832ce91b9b]
azuread_group_member.contributor_reader["pas-prod"]: Refreshing state... [id=a267602b-75ec-42cf-a8d8-eb9ccd4bf68c/member/750bb70f-ccc8-440a-949a-2de1c352d9e4]
azuread_group_member.contributor_reader["paa-dev"]: Refreshing state... [id=0c61cc27-4737-4667-8a54-3b9a3ee33729/member/6d54df21-3547-41a2-8d0d-529fad054807]
azuread_group_member.contributor_reader["pas-dev"]: Refreshing state... [id=c6a58841-32b9-4d00-986a-1d86af5ab745/member/81fa29d0-1ade-4c00-a83f-97a7cdc4eb15]
azuread_group_member.contributor_reader["paa-prod"]: Refreshing state... [id=bf675438-09b8-43f9-a937-2234e911664d/member/c410f062-def4-44f5-9a45-b23ddcdd57c3]
azuread_group_member.contributor_reader["ddp-dev"]: Refreshing state... [id=4820e9b1-488c-4bf2-b9b0-19dd5131d056/member/c12e51e3-5cbd-4229-8a31-5394c423fb5f]
azuread_group_member.contributor_reader["ddp-prod"]: Refreshing state... [id=2beeb094-0970-42bb-9ba4-7e1ba5ed9904/member/a94de4bf-0a83-4d30-baba-0c6a7365571c]
azuread_group_member.contributor_reader["pap-dev"]: Refreshing state... [id=2af7e5da-a5d6-4959-9fd3-4881f8486b48/member/a8e8bad1-021e-4c4a-9d91-c50ef683fd48]
azuread_application_api_access.example_msgraph: Refreshing state... [id=/applications/005b1c70-6fa7-4205-9fa1-8b7a53713238/apiAccess/00000003-0000-0000-c000-000000000000]
azurerm_management_group.parent: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ALP]
data.azurerm_role_definition.contributor: Reading...
data.azurerm_role_definition.reader: Reading...
data.azurerm_role_definition.storage_blob_data_owner: Reading...
data.azurerm_resource_group.tfstate: Reading...
data.azurerm_role_definition.user_access_administrator: Reading...
data.azurerm_subscription.current: Reading...
terraform_data.created_by: Refreshing state... [id=37c5f376-dcd3-2ba0-8608-57e13d065b96]
data.azurerm_role_definition.contributor: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
data.azurerm_role_definition.storage_blob_data_owner: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b]
data.azurerm_role_definition.reader: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7]
data.azurerm_resource_group.tfstate: Read complete after 0s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg]
azurerm_app_configuration.state: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.AppConfiguration/configurationStores/altinnterraformappconf02]
azurerm_role_assignment.product_admins_contributor: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Authorization/roleAssignments/0dbadea2-16ad-5c39-5659-ccffc7b23c1c]
azurerm_storage_account.backend: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2]
data.azurerm_role_definition.user_access_administrator: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9]
azurerm_role_assignment.administrator_contributor: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ALP/providers/Microsoft.Authorization/roleAssignments/34685c6d-e5c1-bcbf-e21a-efbbedd9ccd1]
azurerm_role_assignment.administrator_user_access_administrator: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/ALP/providers/Microsoft.Authorization/roleAssignments/9894c234-66e9-8f5a-2f0e-157fbf701a9c]
azurerm_management_group.management_groups["ddp-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod]
azurerm_management_group.management_groups["pas-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Dev]
azurerm_management_group.management_groups["paa-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod]
azurerm_management_group.management_groups["ddp-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev]
azurerm_management_group.management_groups["pap-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Prod]
azurerm_management_group.management_groups["pas-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Prod]
azurerm_management_group.management_groups["paa-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev]
azurerm_management_group.management_groups["pap-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Dev]
azurerm_role_assignment.developers["pas-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Prod/providers/Microsoft.Authorization/roleAssignments/09471f8c-471b-f9bf-2137-d7ccc7f02261]
azurerm_role_assignment.developers["paa-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/9f1d6d21-08e1-ea16-a4ff-b872525da659]
azurerm_role_assignment.developers["pas-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Dev/providers/Microsoft.Authorization/roleAssignments/6b8e4f2f-e35a-5c1d-03d8-f89fef4dbe6e]
azurerm_role_assignment.developers["paa-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/f7ffaddf-eea6-f3aa-9887-0d14c3cb64e3]
azurerm_role_assignment.developers["ddp-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/fe5ae638-9cd2-cbcb-e017-aa79d67f86b0]
azurerm_role_assignment.developers["ddp-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/a893afa0-ddb0-b926-cde3-0334ca3a1778]
azurerm_role_assignment.developers["pap-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Prod/providers/Microsoft.Authorization/roleAssignments/f46efe83-5a3d-dd15-c163-574b88b6b188]
azurerm_role_assignment.developers["pap-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Dev/providers/Microsoft.Authorization/roleAssignments/ae5be8b3-535b-771e-4063-292e5cbe4ea6]
azurerm_role_assignment.readers["pas-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Dev/providers/Microsoft.Authorization/roleAssignments/5f2501bc-386e-3c45-9588-e852423a8f76]
azurerm_role_assignment.readers["ddp-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/31968f6b-b80d-fd2b-419d-971c1585dbff]
azurerm_role_assignment.readers["ddp-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/73ceeebd-b80b-6120-1792-76a2c0a646c9]
azurerm_role_assignment.readers["pap-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Dev/providers/Microsoft.Authorization/roleAssignments/54982679-501b-cec3-6eb0-0fd4fb7e144e]
azurerm_role_assignment.readers["paa-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/3af25b3c-840e-958f-9145-49fb2a0888b3]
azurerm_role_assignment.readers["paa-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/5168f16c-5e77-708d-4cc8-7fab439543df]
azurerm_role_assignment.readers["pap-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Prod/providers/Microsoft.Authorization/roleAssignments/b8f7b4c0-5945-a43c-ebc4-84309556638e]
azurerm_role_assignment.readers["pas-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Prod/providers/Microsoft.Authorization/roleAssignments/522ff11d-545c-ae76-b3a1-f918bb6e19a4]
azurerm_role_assignment.admins["pas-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Prod/providers/Microsoft.Authorization/roleAssignments/04b8ff29-a1af-b875-54cc-3f2d96d3de66]
azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-frontend-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/0f3740d7-b342-182e-10a5-1c44d4a6aad1]
azurerm_role_assignment.admins["ddp-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/7b2362ff-2b8d-b88e-1691-490accdd1b63]
azurerm_role_assignment.admins["pap-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Dev/providers/Microsoft.Authorization/roleAssignments/db8108bb-2587-02ad-1183-00042a91cec1]
azurerm_role_assignment.admins["pap-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Prod/providers/Microsoft.Authorization/roleAssignments/a1ae656a-5be0-43af-49e3-72622e9aa48a]
azurerm_role_assignment.admins["ddp-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/a57a50a3-6d9a-bdb3-cd6c-4a096551a867]
azurerm_role_assignment.admins["pas-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Dev/providers/Microsoft.Authorization/roleAssignments/7d4397c6-05c2-1dbe-963f-fa9d2d6ea0f9]
azurerm_role_assignment.admins["paa-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/84b09730-ee2a-0769-1340-1d357c74a6cf]
azurerm_role_assignment.admins["paa-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/ed21d537-9f3a-3944-0a71-776b97ed1ed0]
azurerm_role_assignment.apps_contributor["paa-altinn-altinn-access-management-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/72a354d1-52de-33f5-0da7-77faf15b38c4]
azurerm_role_assignment.apps_contributor["pap-altinn-altinn-platform-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Prod/providers/Microsoft.Authorization/roleAssignments/68c3a825-cf2c-aa16-fbcd-de36a622c897]
azurerm_role_assignment.apps_contributor["paa-altinn-altinn-access-management-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/488be8b2-5056-ecee-6469-dd21403539ab]
azurerm_role_assignment.apps_contributor["paa-altinn-altinn-authorization-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/e5cc8f9c-cc61-5e7f-f179-4d8da30371be]
azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-frontend-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/5f9695c6-49a4-1cef-6582-df4cfcb3a3e1]
azurerm_role_assignment.apps_contributor["paa-altinn-altinn-authorization-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/b7452467-8614-7cce-2966-63799cbc5c8c]
azurerm_role_assignment.apps_contributor["pas-altinn-altinn-studio-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Prod/providers/Microsoft.Authorization/roleAssignments/9ae48316-4caa-d5b6-05d6-3f68fff81653]
azurerm_role_assignment.apps_contributor["pap-altinn-altinn-platform-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Dev/providers/Microsoft.Authorization/roleAssignments/4aa108c7-9cb5-7bcc-ecac-a50864da886c]
azurerm_role_assignment.apps_contributor["pas-altinn-altinn-studio-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Dev/providers/Microsoft.Authorization/roleAssignments/27e5c8ab-ee62-4505-26b8-ba5eb35fbba4]
azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/58de2712-0caf-bb15-f9ac-157514ec8f88]
azurerm_role_assignment.apps_contributor["ddp-digdir-dialogporten-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/46690bda-163e-66e1-ab4b-950e99637882]
azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-frontend-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/cfa7e8fa-bdde-eab2-dc44-b2af765ff3a7]
azurerm_role_assignment.apps_user_access_administrator["paa-altinn-altinn-authorization-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/4f69dc8e-5068-0871-6ae0-2b9be0b4417c]
azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Prod/providers/Microsoft.Authorization/roleAssignments/db43100c-235d-996f-5a3f-97ebe8b4ba81]
azurerm_role_assignment.apps_user_access_administrator["paa-altinn-altinn-authorization-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/9e9d4645-3f6c-6e1a-5d18-16131f41890e]
azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/1373e0b8-a03a-4a45-73a8-4723418d91c6]
azurerm_role_assignment.apps_user_access_administrator["pas-altinn-altinn-studio-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Prod/providers/Microsoft.Authorization/roleAssignments/f93348d5-1746-4124-a6fa-c6aae47fc1a6]
azurerm_role_assignment.apps_user_access_administrator["pap-altinn-altinn-platform-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Dev/providers/Microsoft.Authorization/roleAssignments/d99fcb36-d4dd-6734-f360-292517eab568]
azurerm_role_assignment.apps_user_access_administrator["pap-altinn-altinn-platform-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAP-Prod/providers/Microsoft.Authorization/roleAssignments/4b15b459-2fed-fb6b-9269-04a8eba003e4]
azurerm_role_assignment.apps_user_access_administrator["paa-altinn-altinn-access-management-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Dev/providers/Microsoft.Authorization/roleAssignments/79c661bf-0bff-f215-ae31-d2029849f977]
azurerm_role_assignment.apps_user_access_administrator["ddp-digdir-dialogporten-frontend-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/DDP-Dev/providers/Microsoft.Authorization/roleAssignments/aad2b7a4-ac98-b75f-76db-88be9ce43356]
azurerm_role_assignment.apps_user_access_administrator["pas-altinn-altinn-studio-dev"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAS-Dev/providers/Microsoft.Authorization/roleAssignments/f9b798a9-da44-5876-2804-506eb7d99605]
azurerm_role_assignment.apps_user_access_administrator["paa-altinn-altinn-access-management-prod"]: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/PAA-Prod/providers/Microsoft.Authorization/roleAssignments/e099b35b-47fb-45c1-823d-7ed0414a6a7c]
azurerm_storage_container.container: Refreshing state... [id=https://altinnterraformstorage02.blob.core.windows.net/tfstates]
azurerm_role_assignment.product_admins_storage_blob_owner: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/b8d13ae8-f547-736c-849e-d17bbc315612]
azurerm_role_assignment.products["ddp-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/5bbfec22-6466-f5a8-488f-7a8657c63144]
azurerm_role_assignment.products["paa-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/adfc38dd-274c-4ac3-f743-f8ce8d28389a]
azurerm_role_assignment.products["paa-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/0a08568d-af21-b723-e98c-1d45dc04146b]
azurerm_role_assignment.products["pas-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/6f9396e8-ea92-f94b-83f0-94bf4fe15032]
azurerm_role_assignment.products["pap-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/38b8bf17-5713-1a55-7b76-33163a69bfa4]
azurerm_role_assignment.products["ddp-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/8c5da4a1-e015-4ddb-1612-4c4fc6daecae]
azurerm_role_assignment.products["pas-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/912493e2-540e-fa53-6503-5f02419da904]
azurerm_role_assignment.products["pap-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/e544bf7c-75df-c9b2-5c9f-9067bf1d0e83]
azurerm_role_assignment.appregg["ddp-digdir-dialogporten-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/b5a08c45-f2e6-df17-2d19-d42b8939dcd7]
azurerm_role_assignment.appregg["paa-altinn-altinn-authorization-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/61490622-d875-98f8-cb8d-e25fedb4bc45]
azurerm_role_assignment.appregg["ddp-digdir-dialogporten-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/e36c0fdb-9f62-6ed4-2371-babdea9f5613]
azurerm_role_assignment.appregg["pas-altinn-altinn-studio-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/ae3165d9-fae1-03f1-7438-ebf13054a6e9]
azurerm_role_assignment.appregg["pap-altinn-altinn-platform-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/4dd94589-fc3c-db2c-31ff-45409b9a2bc1]
azurerm_role_assignment.appregg["paa-altinn-altinn-authorization-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/08df2468-8ea7-eb4e-104c-78c5f1d84715]
azurerm_role_assignment.appregg["ddp-digdir-dialogporten-frontend-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/860337ff-0242-d1d6-1bba-154cc01555ff]
azurerm_role_assignment.appregg["paa-altinn-altinn-access-management-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/2d7d4249-f75a-e34e-3fb5-142273cb25d0]
azurerm_role_assignment.appregg["pap-altinn-altinn-platform-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/b44efb0e-2a12-efa9-0850-b198e592e036]
azurerm_role_assignment.appregg["ddp-digdir-dialogporten-frontend-prod"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/43e7894d-618a-f9a4-33be-d1af96ddf11c]
azurerm_role_assignment.appregg["pas-altinn-altinn-studio-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/0bd2beff-2342-12ad-7b97-b9955869ef75]
azurerm_role_assignment.appregg["paa-altinn-altinn-access-management-dev"]: Refreshing state... [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates/providers/Microsoft.Authorization/roleAssignments/8f1844e8-94b8-3ea7-7c9f-a252e67bd997]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.product["par-altinn-altinn-receipt-dev"] will be created
  + resource "azuread_application" "product" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GitHub: altinn/altinn-receipt - Dev"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # azuread_application.product["par-altinn-altinn-receipt-prod"] will be created
  + resource "azuread_application" "product" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "GitHub: altinn/altinn-receipt - Prod"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # azuread_application_api_access.example_msgraph will be created
  + resource "azuread_application_api_access" "example_msgraph" {
      + api_client_id  = "00000003-0000-0000-c000-000000000000"
      + application_id = "/applications/005b1c70-6fa7-4205-9fa1-8b7a53713238"
      + id             = (known after apply)
      + role_ids       = [
          + "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9",
          + "62a82d76-70ea-41e2-9197-370581804d09",
        ]
    }

  # azuread_application_federated_identity_credential.oidc_branch["par-altinn-altinn-receipt-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_branch" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.branch.main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.oidc_branch["par-altinn-altinn-receipt-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_branch" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.branch.main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-at21"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.at21"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:at21"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-at22"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.at22"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:at22"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-at23"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.at23"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:at23"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-at24"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.at24"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:at24"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-at25"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.at25"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:at25"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:dev"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-test"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:test"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-dev-yt01"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.yt01"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:yt01"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-prod-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:prod"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-prod-staging"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.staging"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:staging"
    }

  # azuread_application_federated_identity_credential.oidc_environments["par-altinn-altinn-receipt-prod-tt02"] will be created
  + resource "azuread_application_federated_identity_credential" "oidc_environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/altinn/altinn-receipt to have access to the app registration"
      + display_name          = "github.altinn.altinn-receipt.environment.tt02"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:altinn/altinn-receipt:environment:tt02"
    }

  # azuread_group.admins["par-dev"] will be created
  + resource "azuread_group" "admins" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Altinn Product Receipt: Admins Dev"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group.admins["par-prod"] will be created
  + resource "azuread_group" "admins" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Altinn Product Receipt: Admins Prod"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group.developers["par-dev"] will be created
  + resource "azuread_group" "developers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Altinn Product Receipt: Developers Dev"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group.developers["par-prod"] will be created
  + resource "azuread_group" "developers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Altinn Product Receipt: Developers Prod"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group.readers["par-dev"] will be created
  + resource "azuread_group" "readers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Altinn Product Receipt: Readers Dev"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group.readers["par-prod"] will be created
  + resource "azuread_group" "readers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "Altinn Product Receipt: Readers Prod"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azuread_group_member.admin_contributor["par-dev"] will be created
  + resource "azuread_group_member" "admin_contributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azuread_group_member.admin_contributor["par-prod"] will be created
  + resource "azuread_group_member" "admin_contributor" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azuread_group_member.contributor_reader["par-dev"] will be created
  + resource "azuread_group_member" "contributor_reader" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azuread_group_member.contributor_reader["par-prod"] will be created
  + resource "azuread_group_member" "contributor_reader" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azuread_service_principal.product["par-altinn-altinn-receipt-dev"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azuread_service_principal.product["par-altinn-altinn-receipt-prod"] will be created
  + resource "azuread_service_principal" "product" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azurerm_app_configuration.state will be updated in-place
  ~ resource "azurerm_app_configuration" "state" {
        id                         = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.AppConfiguration/configurationStores/altinnterraformappconf02"
        name                       = "altinnterraformappconf02"
      ~ tags                       = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "15-07-2024 14:18:54 UTC"
          - "modifiedBy" = "GitHub: altinn/altinn-platform - Admin"
          - "repository" = "github.com/altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # azurerm_management_group.management_groups["par-dev"] will be created
  + resource "azurerm_management_group" "management_groups" {
      + display_name               = "Altinn-Receipt-Dev"
      + id                         = (known after apply)
      + name                       = "PAR-Dev"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/ALP"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.management_groups["par-prod"] will be created
  + resource "azurerm_management_group" "management_groups" {
      + display_name               = "Altinn-Receipt-Prod"
      + id                         = (known after apply)
      + name                       = "PAR-Prod"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/ALP"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_role_assignment.admins["par-dev"] will be created
  + resource "azurerm_role_assignment" "admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.admins["par-prod"] will be created
  + resource "azurerm_role_assignment" "admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.appregg["par-altinn-altinn-receipt-dev"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR 
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/dev'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/test'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/at21'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/at22'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/at23'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/at24'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/at25'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/yt01'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.appregg["par-altinn-altinn-receipt-prod"] will be created
  + resource "azurerm_role_assignment" "appregg" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
             OR 
             (
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/staging'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/tt02'
              OR
              
              @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt/environments/prod'
              OR
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
             )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["par-altinn-altinn-receipt-dev"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_contributor["par-altinn-altinn-receipt-prod"] will be created
  + resource "azurerm_role_assignment" "apps_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["par-altinn-altinn-receipt-dev"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.apps_user_access_administrator["par-altinn-altinn-receipt-prod"] will be created
  + resource "azurerm_role_assignment" "apps_user_access_administrator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.developers["par-dev"] will be created
  + resource "azurerm_role_assignment" "developers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.developers["par-prod"] will be created
  + resource "azurerm_role_assignment" "developers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.products["par-dev"] will be created
  + resource "azurerm_role_assignment" "products" {
      + condition                        = <<-EOT
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR 
              (
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt'
                  OR
                      @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.products["par-prod"] will be created
  + resource "azurerm_role_assignment" "products" {
      + condition                        = <<-EOT
            (
              (
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/add/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/tags/write'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/delete'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/deleteBlobVersion/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/immutableStorage/runAsSuperUser/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/move/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/manageOwnership/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/permanentDelete/action'})
              AND
              !(ActionMatches{'Microsoft.Storage/storageAccounts/blobServices/containers/blobs/modifyPermissions/action'})
            )
            
              OR 
              (
                
                  @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/altinn-receipt'
                  OR
                      @Resource[Microsoft.Storage/storageAccounts/blobServices/containers/blobs:path] StringStartsWith 'github.com/altinn/~/EOT'
              )
            )
        EOT
      + condition_version                = "2.0"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02/blobServices/default/containers/tfstates"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.readers["par-dev"] will be created
  + resource "azurerm_role_assignment" "readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.readers["par-prod"] will be created
  + resource "azurerm_role_assignment" "readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.backend will be updated in-place
  ~ resource "azurerm_storage_account" "backend" {
        id                                = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02"
        name                              = "altinnterraformstorage02"
      ~ tags                              = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "15-07-2024 14:18:54 UTC"
          - "modifiedBy" = "GitHub: altinn/altinn-platform - Admin"
          - "repository" = "github.com/altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 44 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @sduranc |
| Action | `push` |
| Working Directory | `./infrastructure/products` |
| State | `github.com/altinn/altinn-platform/environments/prod/products.tfstate` |
| Artifact | `github.com_altinn_altinn-platform_environments_prod_products.tfstate`